Revit 2024 API
BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeOrTypeDocumentCorruption Property
 Cannot create a DirectShape or DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateDirectShapeOrTypeDocumentCorruption { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateDirectShapeOrTypeDocumentCorruption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateDirectShapeOrTypeDocumentCorruption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DirectShapeFailures Class
Autodesk.Revit.DB Namespace